package main

import "fmt"

/**
Go语言-切片类型
    切片（Slice）与数组一样，也是可以容纳若干类型相同的元素的容器。与数组不同的是，无法通过切片类型来确定其值的长度。每个切片值都会将数组作为其底层数据结构。我们也把这样的数组称为切片的底层数组。

    表示切片类型的字面量如：

[]int
  或

[]string
    可以看到，它们与数组的类型字面量的唯一不同是不包含代表其长度的信息。因此，不同长度的切片值是有可能属于同一个类型的。相对的，不同长度的数组值必定属于不同类型。对一个切片类型的声明可以这样：

type MySlice []int
    这时，类型MySlice即为切片类型[]int的一个别名类型。除此之外，对切片值的表示也与数组值也极其相似，如：

[]int{1, 2, 3}
    这样的字面量与数组（值）的字面量的区别也只在于最左侧的类型字面量。

    我们在上一节讲到的操作数组值的方法也同样适用于切片值。不过，还有一种操作数组值的方法我们没讲到。这种操作的名称就叫“切片”。实施切片操作的方式就是切片表达式。举例如下：

var numbers3 = [5]int{1, 2, 3, 4, 5}
var slice1 = numbers3[1:4]
    请注意第二条赋值语句中在“=”右边那个部分。切片表达式一般由字符串、数组或切片的值以及由方括号包裹且由英文冒号“:”分隔的两个正整数组成。这两个正整数分别表示元素下界索引和元素上界索引。在本例中，切片表达式numbers3[1:4]的求值结果为[]int{2, 3, 4}。可见，切片表达式的求值结果相当于以元素下界索引和元素上界索引作为依据从被操作对象上“切下”而形成的新值。注意，被“切下”的部分不包含元素上界索引指向的元素。另外，切片表达式的求值结果会是切片类型的，且其元素类型与被“切片”的值的元素类型一致。实际上，slice1这个切片值的底层数组正是numbers3的值。

    实际上，我们也可以在一个切片值上实施切片操作。操作的方式与上述无异。请看下面这个例子：

var slice2 = slice1[1:3]
    据此，slice2的值为[]int{3, 4}。注意，作为切片表达式求值结果的切片值的长度总是为元素上界索引与元素下界索引的差值。

    除了长度，切片值以及数组值还有另外一个属性——容量。数组值的容量总是等于其长度。而切片值的容量则往往与其长度不同。请看下图。

    如图所示，一个切片值的容量即为它的第一个元素值在其底层数组中的索引值与该数组长度的差值的绝对值。为了获取数组、切片或通道类型的值的容量，我们可以使用内建函数cap，如：

var capacity2 int = cap(slice2)
    最后，要注意，切片类型属于引用类型。它的零值即为nil，即空值。如果我们只声明一个切片类型的变量而不为它赋值，那么该变量的值将会是nil。例如，若有这样一个变量：

var slice3 []int

  则它的值会是

nil
 */

func main() {
	var numbers3 = [5]int{1, 2, 3, 4, 5}
	slice3 := numbers3[2 : len(numbers3)] // []int{3,4,5}
	length := (3)
	capacity := (3)
	fmt.Printf("%v, %v\n", (length == len(slice3)), (capacity == cap(slice3)))
	var slice4 []int
	fmt.Println(slice4 == nil)
	fmt.Println(slice3)
	var slice5 = slice3
	fmt.Println(slice5)
	slice5[0] = 0
	fmt.Println(slice5)
	fmt.Println(slice3)
}
